# language: ru
@manual
#noinspection NonAsciiCharacters
Функционал: Каталог шагов BlockCollection

  # Этот файл покрывает все step-definition из пакета blockcollection как каталог примеров.
  # Каталог не предназначен для автопрогона, поэтому помечен тегом @manual.

  Сценарий: Проверить: в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено наведение и нажати...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено наведение и нажатие на блок

  Сценарий: Проверить: в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено нажатие на блок
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    Тогда в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено нажатие на блок

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено нав...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено наведение и нажатие на блок

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено наж...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    Тогда в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено нажатие на блок

  Сценарий: Проверить: в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено наведение и нажати... (2)
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено наведение и нажатие на элемент "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено нажатие на элемент...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    Тогда в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено нажатие на элемент "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено нав... (2)
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено наведение и нажатие на элемент "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено наж... (2)
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    Тогда в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено нажатие на элемент "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" где элемент "ТЕСТ" отображается выполнено нажатие на элемент "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    Тогда в списке блоков "ТЕСТ" где элемент "ТЕСТ" отображается выполнено нажатие на элемент "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" где элемент "ТЕСТ" отображается выполнено нажатие на э...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" где элемент "ТЕСТ" отображается выполнено нажатие на элемент "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено наведение на элеме...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено наведение на элемент "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено нав... (3)
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено наведение на элемент "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" в поле "ТЕСТ" введено значен...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" в поле "ТЕСТ" введено значение "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" в поле "ТЕСТ"...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" в поле "ТЕСТ" введено значение "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" в 1 блоке выполнено нажатие на элемент "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в 1 блоке выполнено нажатие на элемент "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в 1 блоке выполнено нажатие на элемент "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в 1 блоке выполнено нажатие на элемент "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" выполнено нажатие на 1 блок
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" выполнено нажатие на 1 блок

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" выполнено нажатие на 1 блок
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" выполнено нажатие на 1 блок

  Сценарий: Проверить: в списке блоков "ТЕСТ" выполнено нажатие на блок элементы которого соответствуют списку
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" выполнено нажатие на блок элементы которого соответствуют списку
      | Название ссылки | текст содержит | ТЕСТ |

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" выполнено нажатие на блок элементы которого соответств...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" выполнено нажатие на блок элементы которого соответствуют списку
      | Название ссылки | текст содержит | ТЕСТ |

  Сценарий: Проверить: в списке блоков "ТЕСТ" выполнено нажатие на элемент "ТЕСТ" блока который соответствуют условию
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" выполнено нажатие на элемент "ТЕСТ" блока который соответствуют условию
      | Название ссылки | текст содержит | ТЕСТ |

  Сценарий: Проверить: список блоков "ТЕСТ" отображается на странице
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И список блоков "ТЕСТ" отображается на странице

  Сценарий: Проверить: в блоке "ТЕСТ" список блоков "ТЕСТ" отображается на странице
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" список блоков "ТЕСТ" отображается на странице

  Сценарий: Проверить: в списке блоков "ТЕСТ" количество блоков больше 1
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" количество блоков больше 1

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" количество блоков больше 1
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" количество блоков больше 1

  Сценарий: Проверить: список блоков "ТЕСТ" соответствует списку
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И список блоков "ТЕСТ" соответствует списку
      | 1 | Название ссылки | текст содержит | ТЕСТ |

  Сценарий: Проверить: в блоке "ТЕСТ" список блоков "ТЕСТ" соответствует списку
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" список блоков "ТЕСТ" соответствует списку
      | 1 | Название ссылки | текст содержит | ТЕСТ |

  Сценарий: Проверить: список блоков "ТЕСТ" блоки расположены по 1 в ряд
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И список блоков "ТЕСТ" блоки расположены по 1 в ряд

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" блоки расположены по 1 в ряд
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" блоки расположены по 1 в ряд

  Сценарий: Проверить: в списке блоков "ТЕСТ" 1 блок содержит css "ТЕСТ" со значением "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" 1 блок содержит css "ТЕСТ" со значением "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" 1 блок содержит css "ТЕСТ" со значением "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" 1 блок содержит css "ТЕСТ" со значением "ТЕСТ"

  Сценарий: Проверить: список блоков "ТЕСТ" расположен по ширине элемента "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И список блоков "ТЕСТ" расположен по ширине элемента "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" список блоков "ТЕСТ" расположен по ширине элемента "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" список блоков "ТЕСТ" расположен по ширине элемента "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" отображается на странице
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" отображается на странице

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" отображается на странице
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" отображается на странице

  Сценарий: Проверить: в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" не отображается на странице
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" не отображается на странице

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" не отображается на странице
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" не отображается на странице

  Сценарий: Проверить: в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" является изображением и отображается на...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" является изображением и отображается на странице

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" является изображением и...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" является изображением и отображается на странице

  Сценарий: Проверить: в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" содержит текст в формате "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" содержит текст в формате "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" содержит текст в формате...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" содержит текст в формате "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" в каждом блоке в элементе "ТЕСТ" текст не равен "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в каждом блоке в элементе "ТЕСТ" текст не равен "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в каждом блоке в элементе "ТЕСТ" текст не равен "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в каждом блоке в элементе "ТЕСТ" текст не равен "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" содержит css "ТЕСТ" со значением "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" содержит css "ТЕСТ" со значением "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" содержит css "ТЕСТ" со з...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" содержит css "ТЕСТ" со значением "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" не содержит css "ТЕСТ" со значением "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" не содержит css "ТЕСТ" со значением "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" не содержит css "ТЕСТ" с...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в каждом блоке элемент "ТЕСТ" не содержит css "ТЕСТ" со значением "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" каждый из блоков соответствует условиям
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" каждый из блоков соответствует условиям
      | Название ссылки | отображается на странице | |

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" каждый из блоков соответствует условиям
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" каждый из блоков соответствует условиям
      | Название ссылки | отображается на странице | |

  Сценарий: Проверить: в списке блоков "ТЕСТ" любой из блоков соответствует условиям
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" любой из блоков соответствует условиям
      | Название ссылки | отображается на странице | |

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" любой из блоков соответствует условиям
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" любой из блоков соответствует условиям
      | Название ссылки | отображается на странице | |

  Сценарий: Проверить: в списке блоков "ТЕСТ" в любом из блоков в элементе "ТЕСТ" текст равен "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в любом из блоков в элементе "ТЕСТ" текст равен "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в любом из блоков в элементе "ТЕСТ" текст равен "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в любом из блоков в элементе "ТЕСТ" текст равен "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" в любом из блоков в элементе "ТЕСТ" текст соответствует регулярному в...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в любом из блоков в элементе "ТЕСТ" текст соответствует регулярному выражению "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в любом из блоков в элементе "ТЕСТ" текст соответствуе...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в любом из блоков в элементе "ТЕСТ" текст соответствует регулярному выражению "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" в любом из блоков в элементе "ТЕСТ" текст содержит "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в любом из блоков в элементе "ТЕСТ" текст содержит "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" в любом из блоков в элементе "ТЕСТ" текст содержит "ТЕСТ" (2)
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в любом из блоков в элементе "ТЕСТ" текст содержит "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" в любом из блоков в элементе "ТЕСТ" текст содержит
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в любом из блоков в элементе "ТЕСТ" текст содержит

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в любом из блоков "ТЕСТ" в элементе "ТЕСТ" текст содер...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в любом из блоков "ТЕСТ" в элементе "ТЕСТ" текст содержит "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в любом из блоков "ТЕСТ" в элементе "ТЕСТ" текст содер... (2)
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    Тогда в блоке "ТЕСТ" в списке блоков "ТЕСТ" в любом из блоков "ТЕСТ" в элементе "ТЕСТ" текст содержит "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в любом из блоков "ТЕСТ" в элементе "ТЕСТ" текст содержит
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в любом из блоков "ТЕСТ" в элементе "ТЕСТ" текст содержит

  Сценарий: Проверить: в списке блоков "ТЕСТ" в 1 блоках элемент "ТЕСТ" содержит текст в формате "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в 1 блоках элемент "ТЕСТ" содержит текст в формате "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в 1 блоках элемент "ТЕСТ" содержит текст в формате "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в 1 блоках элемент "ТЕСТ" содержит текст в формате "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" в 1 блоках элемент "ТЕСТ" отображается на странице
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в 1 блоках элемент "ТЕСТ" отображается на странице

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в 1 блоках элемент "ТЕСТ" отображается на странице
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в 1 блоках элемент "ТЕСТ" отображается на странице

  Сценарий: Проверить: в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" элемент "ТЕСТ" отображается
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" элемент "ТЕСТ" отображается

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" элемент "ТЕСТ...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" элемент "ТЕСТ" отображается

  Сценарий: Проверить: в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" элемент "ТЕСТ" не отображается
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" элемент "ТЕСТ" не отображается

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" элемент "ТЕСТ... (2)
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" элемент "ТЕСТ" не отображается

  Сценарий: Проверить: в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст соответствует регулярному выражению "ТЕСТ...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст соответствует регулярному выражению "ТЕСТ" элемент "ТЕСТ" отображается

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст соответствует регулярному...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст соответствует регулярному выражению "ТЕСТ" элемент "ТЕСТ" отображается

  Сценарий: Проверить: в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" элемент "ТЕСТ" содержит текс...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" элемент "ТЕСТ" содержит текст в формате "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" элемент "ТЕСТ... (3)
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" элемент "ТЕСТ" содержит текст в формате "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст соответствует регулярному выражению "ТЕСТ... (2)
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст соответствует регулярному выражению "ТЕСТ" элемент "ТЕСТ" содержит текст в формате "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст соответствует регулярному... (2)
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст соответствует регулярному выражению "ТЕСТ" элемент "ТЕСТ" содержит текст в формате "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" элемент "ТЕСТ" содержит css...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" элемент "ТЕСТ" содержит css "ТЕСТ" со значением "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" элемент "ТЕСТ... (4)
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" элемент "ТЕСТ" содержит css "ТЕСТ" со значением "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" блок расположен в видимой ча...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" блок расположен в видимой части браузера

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" блок располож...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" блок расположен в видимой части браузера

  Сценарий: Проверить: в списке блоков "ТЕСТ" координаты 1 блока соответствуют: x=1; y=1
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" координаты 1 блока соответствуют: x=1; y=1

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" координаты 1 блока соответствуют: x=1; y=1
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" координаты 1 блока соответствуют: x=1; y=1

  Сценарий: Проверить: в списке блоков "ТЕСТ" в 1 блоке текст элемента "ТЕСТ" сохранен в переменную "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в 1 блоке текст элемента "ТЕСТ" сохранен в переменную "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в 1 блоке текст элемента "ТЕСТ" сохранен в переменную...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в 1 блоке текст элемента "ТЕСТ" сохранен в переменную "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" в 1 блоке в элементе "ТЕСТ" текст соответствует регулярному выражению...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в 1 блоке в элементе "ТЕСТ" текст соответствует регулярному выражению "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в 1 блоке в элементе "ТЕСТ" текст соответствует регуля...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в 1 блоке в элементе "ТЕСТ" текст соответствует регулярному выражению "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" в 1 блоке в элементе "ТЕСТ" текст равен "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в 1 блоке в элементе "ТЕСТ" текст равен "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в 1 блоке в элементе "ТЕСТ" текст равен "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в 1 блоке в элементе "ТЕСТ" текст равен "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" в 1 блоке элемент "ТЕСТ" содержит css "ТЕСТ" со значением "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в 1 блоке элемент "ТЕСТ" содержит css "ТЕСТ" со значением "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в 1 блоке элемент "ТЕСТ" содержит css "ТЕСТ" со значен...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в 1 блоке элемент "ТЕСТ" содержит css "ТЕСТ" со значением "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" в 1 блоке элемент "ТЕСТ" содержит атрибут "ТЕСТ" со значением "ТЕСТ"
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" в 1 блоке элемент "ТЕСТ" содержит атрибут "ТЕСТ" со значением "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" в 1 блоке элемент "ТЕСТ" содержит атрибут "ТЕСТ" со зн...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" в 1 блоке элемент "ТЕСТ" содержит атрибут "ТЕСТ" со значением "ТЕСТ"

  Сценарий: Проверить: в списке блоков "ТЕСТ" 1 блок расположен в видимой части браузера
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" 1 блок расположен в видимой части браузера

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" 1 блок расположен в видимой части браузера
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" 1 блок расположен в видимой части браузера

  Сценарий: Проверить: в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено сохранение текста...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено сохранение текста элемента "ТЕСТ" в переменную "ТЕСТ"

  Сценарий: Проверить: в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено сох...
    Когда совершен переход на страницу "Википедия" по ссылке "url.wikipedia"
    И в блоке "ТЕСТ" в списке блоков "ТЕСТ" где в элементе "ТЕСТ" текст равен "ТЕСТ" выполнено сохранение текста элемента "ТЕСТ" в переменную "ТЕСТ"
